{
	"Gun Control and Gun Rights": [
		{
			"title": "Police seize over a thousand guns, piles of ammunition from Los Angeles home",
			"description": "A man in Los Angeles' posh Holmby Hills neighborhood was hiding a stash of weapons large enough to outfit an army.",
			"source": "ABC News",
			"rating": "Lean Left",
			"url": "",
			"opinion": false
		},
		{
			"title": "'Mommy, there's a gun ... shot at my school.' Shooting near Columbine leaves 1 dead and 8 wounded",
			"description": "(CNN) - Just a few miles from Columbine High School, gunfire echoed through the hallways of yet another Colorado school.",
			"source": "CNN (Web News)",
			"rating": "Lean Left",
			"url": "",
			"opinion": false
		},
		{
			"title": "Cory Booker unveils bold plan to curb gun violence",
			"description": "Democratic presidential candidate and New Jersey Sen. Cory Booker introduced a sweeping gun violence prevention plan. If elected, the campaign announced...",
			"source": "CBS News",
			"rating": "Lean Left",
			"url": "",
			"opinion": false
		},
		{
			"title": "Cory Booker drops strong, ambitious gun law reform plan",
			"description": "Sen. Cory Booker has taken the strongest position on gun law reform of any candidate in the 2020 Democratic presidential primary, with a proposal to require...",
			"source": "Daily Kos",
			"rating": "Left",
			"url": "",
			"opinion": false
		},
		{
			"title": "New Zealand is showing America how to respond to mass shootings",
			"description": "DAYS AFTER a gunman carried out a horrifying attack on two mosques in Christchurch, New Zealand, that killed 50 people, Prime Minister Jacinda Ardern...",
			"source": "Washington Post",
			"rating": "Lean Left",
			"url": "",
			"opinion": false
		},
		{
			"title": "House sends guns background check bill to the Senate with bipartisan support",
			"description": "The House of Representatives on Wednesday passed significant gun control legislation for the first time in more than two decades, a move that Democrats hope...",
			"source": "CNN (Web News)",
			"rating": "Lean Left",
			"url": "",
			"opinion": false
		},
		{
			"title": "Democratic contenders step up calls for gun control legislation following Illinois shooting",
			"description": "As the nation once again grappled with the tragedy and shock of another workplace shooting rampage, the 2020 Democratic candidates decried the failure of...",
			"source": "CNN (Web News)",
			"rating": "Lean Left",
			"url": "",
			"opinion": false
		},
		{
			"title": "Why the NRA is struggling",
			"description": "Legislative defeats, financial problems, and a surprisingly difficult ally in the White House.",
			"source": "Vox",
			"rating": "Left",
			"url": "",
			"opinion": false
		},
		{
			"title": "Democrats to honor sad anniversary in introducing gun background checks bill on Tuesday",
			"description": "Tuesday is January 8, the eighth anniversary of the shooting that nearly killed then-Rep. Gabby Giffords and did kill six people. And on Tuesday, House...",
			"source": "Daily Kos",
			"rating": "Left",
			"url": "",
			"opinion": false
		},
		{
			"title": "At least 2 handguns used in school shooting near Columbine",
			"description": "Two high school students used at least two handguns in the shooting at a charter school that killed one of their classmates...",
			"source": "Associated Press",
			"rating": "Center",
			"url": "",
			"opinion": false
		},
		{
			"title": "Sen. Cory Booker Rolls Out Gun-Control Proposal",
			"description": "Democratic presidential candidate Cory Booker is proposing an aggressive approach to curb the flow of guns in the U.S., including strict new federal...",
			"source": "Wall Street Journal - News",
			"rating": "Center",
			"url": "",
			"opinion": false
		},
		{
			"title": "Cory Booker wants to start national gun licensing program, limit firearms purchases",
			"description": "Democratic presidential hopeful Cory Booker on Monday unveiled a sweeping plan to reduce gun violence that includes establishing a national gun licensing...",
			"source": "USA TODAY",
			"rating": "Center",
			"url": "",
			"opinion": false
		},
		{
			"title": "20 Years On, The Background Check System Continues To Miss Dangerous Gun Buyers",
			"description": "Twenty years ago, a pair of students killed a teacher and a dozen of their classmates a high school in Littleton, Colo. The shooters at Columbine High...",
			"source": "NPR News",
			"rating": "Center",
			"url": "",
			"opinion": false
		},
		{
			"title": "Shaken by mosque massacre, New Zealand gun owners prepare to hand over banned weapons",
			"description": "Mike Salvesen was working on his farm in the foothills of New Zealand’s Southern Alps last Friday when his phone began pinging with news of a tragedy...",
			"source": "Reuters",
			"rating": "Center",
			"url": "",
			"opinion": false
		},
		{
			"title": "Colorado school shooting leaves at least 1 dead, 8 injured; 2 in custody, sheriff's office says",
			"description": "Two suspects were in custody Tuesday night after a shooting at a Colorado high school left at least one person dead and eight others injured, according to...",
			"source": "Fox News",
			"rating": "Lean Right",
			"url": "",
			"opinion": false
		},
		{
			"title": "Cory Booker: Americans should be 'thrown in jail' if they won't give up their guns",
			"description": "Cory Booker said he backs legislation that would get Americans “thrown in jail” for owning \"assault weapons\" if they do not hand them over in a buyback...",
			"source": "Washington Examiner",
			"rating": "Lean Right",
			"url": "",
			"opinion": false
		},
		{
			"title": "Booker Refuses To Say Whether His Plan Would Result In Jailed Gun Owners",
			"description": "Senator Cory Booker (D., N.J.) refused Monday to say definitively whether he would support the prosecution, and potential incarceration, of gun owners who...",
			"source": "National Review",
			"rating": "Right",
			"url": "",
			"opinion": false
		},
		{
			"title": "Colorado's New 'Red Flag' Law Illustrates the Pitfalls of Disarming People Based on Their Future Behavior",
			"description": "The process for obtaining \"extreme risk protection orders\" that take away people's Second Amendment rights is rigged against gun owners from the outset....",
			"source": "Reason",
			"rating": "Lean Right",
			"url": "",
			"opinion": false
		},
		{
			"title": "NRA's legal troubles, support for Trump in 2016 drain finances despite record membership growth",
			"description": "Used to making news on Capitol Hill as one of the most powerful lobbying groups, the National Rifle Association is instead making waves in courtrooms, where...",
			"source": "Washington Times",
			"rating": "Lean Right",
			"url": "",
			"opinion": false
		},
		{
			"title": "Federal court strikes down California gun magazine ban",
			"description": "A federal judge in California struck down the state's gun magazine ban Friday, saying it was unconstitutional.",
			"source": "Washington Examiner",
			"rating": "Lean Right",
			"url": "",
			"opinion": false
		},
		{
			"title": "Gun Control, background checks",
			"description": "Federal gun background checks fall to lowest monthly level in four years",
			"source": "Washington Times",
			"rating": "Lean Right",
			"url": "",
			"opinion": false
		},
		{
			"title": "Why New Zealand's new gun controls would be unconstitutional in America",
			"description": "As my colleague Anna Giaritelli notes, gun control activists are calling for U.S. adoption of New Zealand's new gun regulations, as ordered by Prime...",
			"source": "Washington Examiner",
			"rating": "Lean Right",
			"url": "",
			"opinion": false
		},
		{
			"title": "New Zealand prime minister announces ban on 'military-style semi-automatic weapons' after mosque attack",
			"description": "New Zealand Prime Minister Jacinda Ardern on Thursday announced the country was immediately banning \"military-style semi-automatic weapons\" after last week'...",
			"source": "Fox News",
			"rating": "Lean Right",
			"url": "",
			"opinion": false
		},
		{
			"title": "The Bogus Lawsuit against Remington",
			"description": "Two kinds of opportunism are at play against the gun manufacturer: financial and political.",
			"source": "National Review",
			"rating": "Right",
			"url": "",
			"opinion": false
		},
		{
			"title": "New Zealand bans military-style assault rifles after deadliest attack in nation's history",
			"description": "New Zealand is banning all assault rifles, high-capacity magazines and military-style semi-automatic rifles in response to the nation's deadliest massacre...",
			"source": "USA TODAY",
			"rating": "Center",
			"url": "",
			"opinion": false
		},
		{
			"title": "House passes bill expanding background checks on gun sales",
			"description": "The House passed a bipartisan bill that would require all gun sellers to conduct background checks on firearm sales in a 240-190 vote on Wednesday.",
			"source": "The Hill",
			"rating": "Center",
			"url": "",
			"opinion": false
		},
		{
			"title": "One year after Parkland, what has – and hasn’t – changed",
			"description": "Charlton Heston once held a rifle over his head and declared the government would only pry it from his “cold, dead hands.”",
			"source": "Christian Science Monitor",
			"rating": "Center",
			"url": "",
			"opinion": false
		},
		{
			"title": "Trump administration bans bump stocks",
			"description": "The Trump administration is issuing a final rule that bans bump stocks, devices that allow semi-automatic weapons to fire much more rapidly, the Department...",
			"source": "The Hill",
			"rating": "Center",
			"url": "",
			"opinion": false
		}
	],

	"Immigration": [
		{
			"title": "Room for Debate: Should ‘Birthright Citizenship’ Be Abolished?",
			"description": "“Birthright citizenship,” the constitutional rule that a child born in and under the jurisdiction of the United States is a U.S. citizen, is in the news a...",
			"source": "New York Times",
			"rating": "Lean Left",
			"url": "",
			"opinion": false
		},
		{
			"title": "The House is finally going to vote on immigration bills next week",
			"description": "Moderate Republicans gave up on bipartisanship and joined the fight for Republican-led immigration policy.",
			"source": "Vox",
			"rating": "Lean Left",
			"url": "",
			"opinion": false
		},
		{
			"title": "Judge rules that challenge to family separation at border can proceed",
			"description": "A federal judge in California ruled Wednesday that a challenge to the practice of separating parents seeking asylum from children at the border can proceed...",
			"source": "CNN (Web News)",
			"rating": "Lean Left",
			"url": "",
			"opinion": false
		},
		{
			"title": "Federal Agencies Lost Track of Nearly 1,500 Migrant Children Placed With Sponsors",
			"description": "A top official with the Department of Health and Human Services told members of Congress on Thursday that the agency had lost track of nearly 1,500 migrant...",
			"source": "New York Times",
			"rating": "Lean Left",
			"url": "",
			"opinion": false
		},
		{
			"title": "Fact-checking immigration spin on separating families and 1,500 ‘lost’ children",
			"description": "Trump blames Democrats for a law that separates undocumented immigrant children from their families. Some Democrats blame Trump’s administration for losing...",
			"source": "Washington Post",
			"rating": "Lean Left",
			"url": "",
			"opinion": false
		},
		{
			"title": "GOP will vote on immigration next week, sinking discharge petition",
			"description": "House Republican leaders will bring a pair of immigration bills to the floor next week, sinking a push from reform-minded centrists to force votes on...",
			"source": "The Hill",
			"rating": "Center",
			"url": "",
			"opinion": false
		},
		{
			"title": "Pizza delivery man facing deportation draws stay, support of leaders",
			"description": "Gov. Andrew Cuomo joined the chorus of New York officials calling for the release of an Ecuadorian native detained while delivering pizza at a Brooklyn Army...",
			"source": "USA TODAY",
			"rating": "Center",
			"url": "",
			"opinion": false
		},
		{
			"title": "Exclusive: Nearly 1,800 families separated at U.S.-Mexico border in 17 months through February",
			"description": "Nearly 1,800 immigrant families were separated at the U.S.-Mexico border from October 2016 through February of this year, according to a senior government...",
			"source": "Reuters",
			"rating": "Center",
			"url": "",
			"opinion": false
		},
		{
			"title": "US child migrants: Sessions defends border separations",
			"description": "US Attorney General Jeff Sessions has defended separating migrant children from their parents at the US border.",
			"source": "BBC News",
			"rating": "Center",
			"url": "",
			"opinion": false
		},
		{
			"title": "Steve Bannon predicts government shutdown unless Congress funds border wall",
			"description": "Ousted White House strategist Steve Bannon predicts another government shutdown before the midterm elections over President Trump's insistence that Congress...",
			"source": "USA TODAY",
			"rating": "Center",
			"url": "",
			"opinion": false
		},
		{
			"title": "Trump's Justice Department tells court DACA is illegal, but oppose striking it down immediately",
			"description": "The Trump administration told a federal judge late Friday that it won’t defend the legality of the Obama-era DACA amnesty — but said the court should be...",
			"source": "Washington Times",
			"rating": "Lean Right",
			"url": "",
			"opinion": false
		},
		{
			"title": "Next Week: Congress returns to immigration stalemate",
			"description": "House Republicans will inch closer to a major immigration reform debate when they return to work next week, while the Senate plans a major announcement that...",
			"source": "Washington Examiner",
			"rating": "Right",
			"url": "",
			"opinion": false
		},
		{
			"title": "Exploiting nonexistent 'lost children' in a bid to win an election",
			"description": "Unless you have been comatose for the past week, it is highly likely that you have seen a statistic or a headline that would lead you to believe that the...",
			"source": "Washington Times",
			"rating": "Lean Right",
			"url": "",
			"opinion": false
		},
		{
			"title": "Remember those brutal immigrant detention centers liberals tried to pin on Trump? It was all Obama",
			"description": "Liberals and even ostensibly objective journalists are experts at getting themselves outraged. But only if they think that an abuse is occurring under...",
			"source": "Washington Examiner",
			"rating": "Right",
			"url": "",
			"opinion": true
		},
		{
			"title": "We’ve Lost Sight of the Plot in the Immigration Debate",
			"description": "There are legitimate policy arguments on all sides, but the story of immigration is getting slaughtered in the crossfire.",
			"source": "National Review",
			"rating": "Right",
			"url": "",
			"opinion": false
		}
	]
}








